In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
titanic = pd.read_csv("../../Data/titanic.csv")

In [56]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [45]:
titanic_slice = titanic.iloc[:, [2,3]]

In [5]:
titanic_slice

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

## We divide the data into two groups based. The first group is male Passengers and the second is female passengers.

In [7]:
gr_titanic = list(titanic_slice.groupby(by="sex"))

In [8]:
gr_titanic

[('female',
          sex   age
  1    female  38.0
  2    female  26.0
  3    female  35.0
  8    female  27.0
  9    female  14.0
  ..      ...   ...
  880  female  25.0
  882  female  22.0
  885  female  39.0
  887  female  19.0
  888  female   NaN

  [314 rows x 2 columns]),
 ('male',
        sex   age
  0    male  22.0
  4    male  35.0
  5    male   NaN
  6    male  54.0
  7    male   2.0
  ..    ...   ...
  883  male  28.0
  884  male  25.0
  886  male  27.0
  889  male  26.0
  890  male  32.0

  [577 rows x 2 columns])]

## First [0] is female passengers and [1] is male passengers. And  [1] is the data of the group.

In [11]:
gr_titanic[0][1]

        sex   age
1    female  38.0
2    female  26.0
3    female  35.0
8    female  27.0
9    female  14.0
..      ...   ...
880  female  25.0
882  female  22.0
885  female  39.0
887  female  19.0
888  female   NaN

[314 rows x 2 columns]

In [12]:
gr_titanic[1][1]

      sex   age
0    male  22.0
4    male  35.0
5    male   NaN
6    male  54.0
7    male   2.0
..    ...   ...
883  male  28.0
884  male  25.0
886  male  27.0
889  male  26.0
890  male  32.0

[577 rows x 2 columns]

## We need transform first Df in OBJ Groupby and then we can use the mean method.
### When applay a method for a Obj Groupby, Df is transformed in a new Df with the result of the method.

In [27]:
titanic_slice.groupby(by='sex').mean()

              age
sex
female  27.915709
male    30.726645

In [28]:
titanic.groupby(by='sex').sum()

,survived,pclass,age,sibsp,parch,fare,embarked,deck
sex,,,,,,,,
female,233,678,7286.00,218,204,13966.6628,CSSSCSSSSSCQSSQCQSCSSCQQSCSSSSSSSQSSSSSSQCSCSS...,CCGCBDBFCEFDCECBBGDDCGBCCDBCBECECBCECDBECFEDBD...
male,109,1379,13919.17,248,136,14727.2865,SSQSSSSQSSSSCSSCSCSCSCSQCSSCSCSCSSCCSSSSCSSSSS...,EDACBCCFEADDCBDCBFBAFAFACCDCEBCADCCCCCFCECBECE...

## We can use groupby and a column to get the sum of the survived passengers.
## First we group by sexand then we select survived column and apply the sum method. And result is the sum of survived passengers.

In [30]:
titanic.groupby(by='sex').survived.sum()

sex
female    233
male      109
Name: survived, dtype: int64

## We can use groupby and a column to get the max value for fare and age for each group.

In [31]:
titanic.groupby(by='sex')[["fare", "age"]].max()

            fare   age
sex
female  512.3292  63.0
male    512.3292  80.0

### First we group, second we select survived column and apply the mean method and finally we sort the values in descending order.

In [61]:
titanic.groupby(by=['sex', 'pclass']).survived.mean().sort_values(ascending=False)

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64